### Terraform Plan - dev Environment

#### Terraform Initialization ``
#### Terraform Validation ``
#### Terraform Plan `success`

<details><summary>Show Plan</summary>

```terraform
terraform
Acquiring state lock. This may take a few moments...
google_service_account.dataform_sa: Refreshing state... [id=projects/ats-theme-dmo-b2bdatacolab/serviceAccounts/dev-dataform-sa@ats-theme-dmo-b2bdatacolab.iam.gserviceaccount.com]
google_bigquery_dataset.dataset: Refreshing state... [id=projects/ats-theme-dmo-b2bdatacolab/datasets/dev_dataform_dataset]
google_project_service.dataform_api: Refreshing state... [id=ats-theme-dmo-b2bdatacolab/dataform.googleapis.com]
google_dataform_repository.repo: Refreshing state... [id=projects/ats-theme-dmo-b2bdatacolab/locations/asia-northeast1/repositories/dev-dataform-repo]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_bigquery_dataset.dataset will be created
  + resource "google_bigquery_dataset" "dataset" {
      + creation_time              = (known after apply)
      + dataset_id                 = "dev_dataform_dataset"
      + default_collation          = (known after apply)
      + delete_contents_on_destroy = false
      + effective_labels           = {
          + "environment"                = "dev"
          + "goog-terraform-provisioned" = "true"
          + "managed_by"                 = "terraform"
        }
      + etag                       = (known after apply)
      + id                         = (known after apply)
      + is_case_insensitive        = (known after apply)
      + labels                     = {
          + "environment" = "dev"
          + "managed_by"  = "terraform"
        }
      + last_modified_time         = (known after apply)
      + location                   = "asia-northeast1"
      + max_time_travel_hours      = (known after apply)
      + project                    = "ats-theme-dmo-b2bdatacolab"
      + self_link                  = (known after apply)
      + storage_billing_model      = (known after apply)
      + terraform_labels           = {
          + "environment"                = "dev"
          + "goog-terraform-provisioned" = "true"
          + "managed_by"                 = "terraform"
        }
    }

  # google_dataform_repository.repo will be created
  + resource "google_dataform_repository" "repo" {
      + effective_labels = {
          + "environment" = "dev"
          + "managed_by"  = "terraform"
        }
      + id               = (known after apply)
      + labels           = {
          + "environment" = "dev"
          + "managed_by"  = "terraform"
        }
      + name             = "dev-dataform-repo"
      + project          = "ats-theme-dmo-b2bdatacolab"
      + region           = "asia-northeast1"
      + terraform_labels = {
          + "environment" = "dev"
          + "managed_by"  = "terraform"
        }
    }

  # google_service_account.dataform_sa will be created
  + resource "google_service_account" "dataform_sa" {
      + account_id   = "dev-dataform-sa"
      + disabled     = false
      + display_name = "Dev Dataform Service Account"
      + email        = "dev-dataform-sa@ats-theme-dmo-b2bdatacolab.iam.gserviceaccount.com"
      + id           = (known after apply)
      + member       = "serviceAccount:dev-dataform-sa@ats-theme-dmo-b2bdatacolab.iam.gserviceaccount.com"
      + name         = (known after apply)
      + project      = "ats-theme-dmo-b2bdatacolab"
      + unique_id    = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pushed by: @ThanhHCSigmaXYZ, Action: `pull_request`*